gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_module/amod_api.c
				LOG_DBG("No free data buffer for module %st, ret %d", hdl->name,
					ret);
				continue;
			}

			ret = data_fifo_pointer_first_vacant_get(&hdl->out_msg, (void **)&out_msg,
								 K_NO_WAIT);
			if (ret) {
				clean_up(hdl, &in_msg, &out_msg, &data);

				LOG_DBG("No free message for module %s, ret %d", hdl->name, ret);
				continue;
			}

			/* Configure new audio object */
			memcpy(&out_msg->object, in_msg->object, sizeof(struct aobj_object));
			out_msg->object.data = data;
			out_msg->object.data_size = hdl->data_size;

			/* Process the input audio object */
			ret = hdl->functions->data_process(handle, NULL, &out_msg->object);
			if (ret) {
				clean_up(hdl, &in_msg, &out_msg, &data);

				LOG_DBG("Data process error in module %s, ret %d", hdl->name, ret);
				continue;
			}

			k_mutex_init(&hdl->dest_mutex);

			/* Send output audio object to next module(s) */
			if (!sys_slist_is_empty(&hdl->hdl_dest_list)) {
				SYS_SLIST_FOR_EACH_CONTAINER(&amod_handles, handle_to, node) {
					ret = data_send(handle, handle_to, &out_msg->object,
							&data_release_cb);
				}
			} else {
				/* Send output audio object back to module sending the data */
				ret = data_fifo_block_lock(&hdl->out_msg, (void **)&out_msg,
							   sizeof(struct _amod_in_message));
				if (ret) {
					clean_up(hdl, &in_msg, &out_msg, &data);

					LOG_DBG("Module %s failed to return output buffer, ret %d",
						hdl->name, ret);
					continue;
				}
				LOG_DBG("Data sent from module %s", hdl->name);
			}

		} else {
			LOG_DBG("No process function for module %s, discarding input", hdl->name);
		}
	}

	return 0;
}

/**
 * @brief The thread that processes inputs and outputs them out of the audio system.
 *
 * @param handle  The handle for this modules instance
 *
 * @return 0 if successful, error value
 */
static int module_thread_output(struct amod_handle *handle)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	int ret;
	struct _amod_in_message *in_msg;
	size_t size;
	struct _amod_out_message *out_msg;
	char *data = NULL;

	if (handle == NULL) {
		LOG_DBG("Error in the module task as handle NULL");
		return -EINVAL;
	}

	/* Execute thread */
	for (;;) {
		in_msg = NULL;
		out_msg = NULL;
		data = NULL;

		ret = data_fifo_pointer_last_filled_get(&hdl->in_msg, (void **)&in_msg, &size,
							K_FOREVER);
		if (ret) {
			LOG_DBG("No new data for module %s, ret %d", hdl->name, ret);
			continue;
		}

		if (in_msg->object == NULL) {
			clean_up(hdl, &in_msg, &out_msg, &data);

			LOG_DBG("Error in input data for module %s", hdl->name);
			continue;
		}

		if (hdl->functions->data_process != NULL) {
			/* Process the input audio object and output from the audio system */
			ret = hdl->functions->data_process(handle, in_msg->object, NULL);
			if (ret) {
				clean_up(hdl, &in_msg, &out_msg, &data);

				LOG_DBG("Data process error in module %s, ret %d", hdl->name, ret);
				continue;
			}
			if (in_msg->response_cb != NULL) {
				in_msg->response_cb(in_msg->tx_handle, in_msg->object);
			}

		} else {
			LOG_DBG("No process function for module %s, discarding input", hdl->name);
		}

		data_fifo_block_free(&hdl->in_msg, (void **)&in_msg);
	}

	return 0;
}

/**
 * @brief The thread that processes inputs and returns data form the module
 *
 * @param handle  The handle for this modules instance
 *
 * @return 0 if successful, error value
 */
static int module_thread_processor(struct amod_handle *handle)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	int ret;
	struct _amod_in_message *in_msg;
	struct _amod_out_message *out_msg;
	char *data = NULL;
	size_t size;

	if (handle == NULL) {
		LOG_DBG("Error in the module task as handle NULL");
		return -EINVAL;
	}

	/* Execute thread */
	for (;;) {
		in_msg = NULL;
		out_msg = NULL;
		data = NULL;

		ret = data_fifo_pointer_last_filled_get(&hdl->in_msg, (void **)&in_msg, &size,
							K_FOREVER);
		if (ret) {
			LOG_DBG("No new message for module %s, ret %d", hdl->name, ret);
			continue;
		}

		if (in_msg->object == NULL) {
			clean_up(hdl, &in_msg, &out_msg, &data);

			LOG_DBG("Error in input message for module %s", hdl->name);
			continue;
		}

		if (hdl->functions->data_process != NULL) {
			/* Get a new output buffer from outside the audio system */
			ret = k_mem_slab_alloc(&hdl->data_slab, (void **)&data, K_NO_WAIT);
			if (ret) {
				clean_up(hdl, &in_msg, &out_msg, &data);

				LOG_DBG("No free data buffer for module %s, dropping input, ret %d",
					hdl->name, ret);
				continue;
			}

			ret = data_fifo_pointer_first_vacant_get(&hdl->out_msg, (void **)&out_msg,
								 K_NO_WAIT);
			if (ret) {
				clean_up(hdl, &in_msg, &out_msg, &data);

				LOG_DBG("No free message for module %s, dropping input, ret %d",
					hdl->name, ret);
				continue;
			}

			/* Configure new audio object */
			memcpy(&out_msg->object, in_msg->object, sizeof(struct aobj_object));
			out_msg->object.data = data;
			out_msg->object.data_size = hdl->data_size;

			/* Process the input audio object into the output audio object */
			ret = hdl->functions->data_process(handle, in_msg->object,
							   &out_msg->object);
			if (ret) {
				clean_up(hdl, &in_msg, &out_msg, &data);

				LOG_DBG("Data process error in module %s, ret %d", hdl->name, ret);
				continue;
			}

			/* Send output audio object to next module(s) */
			if (!sys_slist_is_empty(&hdl->hdl_dest_list)) {
				SYS_SLIST_FOR_EACH_CONTAINER(&amod_handles, handle_to, node) {
					ret = data_send(handle, handle_to, &out_msg->object,
							&data_release_cb);
				}
			} else {
				/* Send output audio object back to module sending the data */
				ret = data_fifo_block_lock(&hdl->out_msg, (void **)&out_msg,
							   sizeof(struct _amod_in_message));
				if (ret) {
					clean_up(hdl, &in_msg, &out_msg, &data);

					LOG_DBG("Module %s failed to return output buffer, ret %d",
						hdl->name, ret);
					continue;
				}
				LOG_DBG("Data sent from module %s", hdl->name);
			}

			if (in_msg->response_cb != NULL) {
				in_msg->response_cb(in_msg->tx_handle, in_msg->object);
			}

		} else {
			LOG_DBG("No process function for module %s, discarding input", hdl->name);
		}

		data_fifo_block_free(&hdl->in_msg, (void **)&in_msg);
	}

