gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_module/amod_api.c
	return 0;
}
/**
 * @brief  Function for querying the resources required for a module.
 */
int amod_query_resource(struct amod_parameters *parameters,
			struct amod_configuration *configuration)
{
	struct _amod_parameters *params = (struct _amod_parameters *)parameters;
	int ret;
	int size = 0;

	ret = validate_params(parameters);
	if (ret) {
		LOG_DBG("Invalid parameters for module, returned %d", ret);
		return ret;
	}

	if (params->functions->query_resource != NULL) {
		size = params->functions->query_resource(configuration);
		if (size < 0) {
			LOG_DBG("Failed query resource for module %s, ret %d", params->name, size);
			return -EFAULT;
		}
	} else {
		LOG_DBG("No query resource function for module %s", params->name);
	}

	size += WB_UP(sizeof(struct _amod_handle));

	return size;
};

/**
 * @brief  Function for opening a module.
 */
int amod_open(struct amod_parameters *parameters, struct amod_configuration *configuration,
	      struct amod_thread_configuration *thread_configuration, char *name,
	      char *in_msg_block, char *out_msg_block, char *data_block, size_t data_size,
	      uint32_t data_num, struct amod_handle *handle)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	struct _amod_parameters *params = (struct _amod_parameters *)parameters;
	struct _amod_thread_configuration *thread_config =
		(struct _amod_thread_configuration *)thread_configuration;
	int ret;

	if (handle == NULL) {
		LOG_DBG("Input handle parameter is NULL for module %s in the open function", name);
		return -EINVAL;
	}

	if (hdl->state == AMOD_STATE_OPEN) {
		LOG_DBG("Module %s is already open", hdl->name);
		return -EALREADY;
	}

	ret = validate_params(parameters);
	if (ret) {
		LOG_DBG("Invalid parameters for module, ret %d", ret);
		return ret;
	}

	if (thread_configuration == NULL) {
		LOG_DBG("Error within the thread parameters for module %s", name);
		return -EINVAL;
	}

	memset(handle, 0, WB_UP(sizeof(struct _amod_handle)));

	hdl->type = params->type;

	if (hdl->type == AMOD_TYPE_INPUT && out_msg_block == NULL && data_block == NULL) {
		LOG_DBG("Incorrect memory for module %s in the open function", name);
		return -EINVAL;
	}

	if (hdl->type == AMOD_TYPE_OUTPUT && in_msg_block == NULL) {
		LOG_DBG("Incorrect memory for module %s in the open function", name);
		return -EINVAL;
	}

	if (in_msg_block == NULL && out_msg_block == NULL && data_block == NULL) {
		LOG_DBG("Incorrect memory for module %s in the open function", name);
		return -EINVAL;
	}

	hdl->previous_state = AMOD_STATE_UNKNOWN;
	hdl->state = AMOD_STATE_UNKNOWN;

	hdl->context = (struct amod_context *)((char *)handle + WB_UP(sizeof(struct _amod_handle)));

	memcpy(hdl->name, name, AMOD_NAME_SIZE);
	memcpy(hdl->base_name, params->name, AMOD_NAME_SIZE);
	hdl->functions = params->functions;

	memcpy(&hdl->thread, thread_config, sizeof(struct _amod_thread_configuration));

	sys_slist_init(&hdl->hdl_dest_list);
	k_mutex_init(&hdl->dest_mutex);

	if (hdl->functions->open != NULL) {
		ret = hdl->functions->open(handle, configuration);
		if (ret) {
			LOG_DBG("Failed open call to module %s, ret %d", name, ret);
			return ret;
		}
	}

	if (hdl->type != AMOD_TYPE_INPUT) {
		hdl->in_msg.msgq_buffer = WB_UP(in_msg_block);
		hdl->in_msg.slab_buffer =
			WB_UP(in_msg_block + AMOD_IN_MSG_SET_SIZE(hdl->thread->in_msg_num));
		hdl->in_msg.block_size_max = WB_UP(sizeof(struct _amod_in_message));
		hdl->in_msg.elements_max = hdl->thread->in_msg_num;
		hdl->in_msg.initialized = false;
		ret = data_fifo_init(&hdl->in_msg);
		if (ret) {
			LOG_DBG("Failed to initialise module %s data in FIFO, ret %d", hdl->name,
				ret);
			return ret;
		}
	}

	if (hdl->type != AMOD_TYPE_OUTPUT) {
		hdl->out_msg.msgq_buffer = WB_UP(out_msg_block);
		hdl->out_msg.slab_buffer =
			WB_UP(out_msg_block + AMOD_OUT_MSG_SET_SIZE(hdl->thread->out_msg_num));
		hdl->out_msg.block_size_max = WB_UP(sizeof(struct _amod_out_message));
		hdl->out_msg.elements_max = hdl->thread->out_msg_num;
		hdl->out_msg.initialized = false;
		ret = data_fifo_init(&hdl->out_msg);
		if (ret) {
			LOG_DBG("Failed to initialise module %s data output FIFO, ret %d",
				hdl->name, ret);
			return ret;
		}

		hdl->data_size = data_size;
		hdl->data_slab = WB_UP(data + (data_num * WB_UP(hdl->data_size)));
		hdl->data_size = WB_UP(hdl->data_size);
		ret = k_mem_slab_init(&hdl->mem_slab, hdl->data_slab, hdl->data_size, data_num);
		if (ret) {
			LOG_DBG("Failed to initialise module %s data slab, ret %d", hdl->name, ret);
			return ret;
		}

		ret = sys_sem_init(&hdl->count_sem, 0, CONFIG_AMOD_SINK_MODULE_NUM);
		if (ret) {
			LOG_DBG("Failed to intiialise module %s counting semaphore, ret %d",
				hdl->name, ret);
			return ret;
		}

		hdl->output_handles_num = 0;
	}

	switch (hdl->type) {
	case AMOD_TYPE_INPUT:
		hdl->thread_id =
			k_thread_create(&hdl->thread_data, hdl->thread.stack,
					hdl->thread.stack_size,
					(k_thread_entry_t)module_thread_input, hdl, NULL, NULL,
					K_PRIO_PREEMPT(hdl->thread.priority), 0, K_NO_WAIT);

		ret = k_thread_name_set(hdl->thread_id, hdl->name);
		if (ret) {
			LOG_DBG("Failed to start input module %s thread, ret %d", hdl->name, ret);
			return ret;
		}

		break;

	case AMOD_TYPE_OUTPUT:
		hdl->thread_id =
			k_thread_create(&hdl->thread_data, hdl->thread.stack,
					hdl->thread.stack_size,
					(k_thread_entry_t)module_thread_output, hdl, NULL, NULL,
					K_PRIO_PREEMPT(hdl->thread.priority), 0, K_NO_WAIT);

		ret = k_thread_name_set(hdl->thread_id, hdl->name);
		if (ret) {
			LOG_DBG("Failed to start output module %s thread, ret %d", hdl->name, ret);
			return ret;
		}

		break;

	case AMOD_TYPE_PROCESSOR:
		hdl->thread_id =
			k_thread_create(&hdl->thread_data, hdl->thread.stack,
					hdl->thread.stack_size,
					(k_thread_entry_t)module_thread_processor, hdl, NULL, NULL,
					K_PRIO_PREEMPT(hdl->thread.priority), 0, K_NO_WAIT);

		ret = k_thread_name_set(hdl->thread_id, hdl->name);
		if (ret) {
			LOG_DBG("Failed to start processor module %s thread, ret %d", hdl->name,
				ret);
			return ret;
		}

		break;

	default:
		LOG_DBG("Invalid module type%d for module %s", hdl->type, hdl->name);
		return -EINVAL;
	}

	hdl->state = AMOD_STATE_OPEN;

