gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_module/amod_api.c
	LOG_DBG("Module %s is now open", hdl->name);

	return 0;
}

/**
 * @brief  Function to close an open module.
 */
int amod_close(struct amod_handle *handle)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (TEST_STATE_RUNNING(hdl->state)) {
		LOG_DBG("Module %s in an invalid state, %d, for close", hdl->name, hdl->state);
		return -ENOTSUP;
	}

	if (hdl->functions->close != NULL) {
		ret = hdl->functions->close(handle);
		if (ret) {
			LOG_DBG("Failed close call to module %s, returned %d", hdl->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("Module %s has no close function", hdl->name);
	}

	data_fifo_empty(&hdl->in_msg);
	data_fifo_empty(&hdl->out_msg);
	data_fifo_empty(&hdl->data);

	k_thread_abort(hdl->thread_id);

	return 0;
};

/**
 * @brief  Function to set the configuration of a module.
 */
int amod_configuration_set(struct amod_handle *handle, struct amod_configuration *configuration)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	int ret;

	if (handle == NULL || configuration == NULL) {
		LOG_DBG("Module input parameter error");
		return -EINVAL;
	}

	if (TEST_STATE_OPEN(hdl->state)) {
		LOG_DBG("Module %s in an invalid state, %d, for setting the configuration",
			hdl->name, hdl->state);
		return -ENOTSUP;
	}

	if (hdl->functions->configuration_set != NULL) {
		ret = hdl->functions->configuration_set(handle, configuration);
		if (ret) {
			LOG_DBG("Set configuration for module %s send failed, ret %d", hdl->name,
				ret);
			return ret;
		}
	} else {
		LOG_DBG("No set configuration function for module %s", hdl->name);
	}

	hdl->previous_state = hdl->state;
	hdl->state = AMOD_STATE_CONFIGURED;

	return 0;
};

/**
 * @brief  Function to get the configuration of a module.
 */
int amod_configuration_get(struct amod_handle *handle, struct amod_configuration *configuration)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	int ret;

	if (handle == NULL || configuration == NULL) {
		LOG_DBG("Module input parameter error");
		return -EINVAL;
	}

	if (TEST_STATE_OPEN(hdl->state)) {
		LOG_DBG("Module %s in an invalid state, %d, for getting the configuration",
			hdl->name, hdl->state);
		return -ENOTSUP;
	}

	if (hdl->functions->configuration_get != NULL) {
		ret = hdl->functions->configuration_get(handle, configuration);
		if (ret) {
			LOG_DBG("Get configuration for module %s failed, ret %d", hdl->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("No get configuration function for module %s", hdl->name);
		return -ENOSYS;
	}

	return 0;
};

/**
 * @brief Function to connect two modules together.
 *
 */
int amod_connect(struct amod_handle *handle_from, struct amod_handle *handle_to)
{
	struct _amod_handle *hdl_from = (struct _amod_handle *)handle_from;
	struct _amod_handle *hdl_to = (struct _amod_handle *)handle_to;

	if (handle_from == NULL || handle_to == NULL) {
		LOG_DBG("Invalid paramet for the connection function");
		return -EINVAL;
	}

	if (TEST_STATE_RUNNING_OR_OPEN(hdl_from->state) || hdl->type != AMOD_TYPE_PROCESSOR) {
		LOG_DBG("A module is an invalid state or type for connecting modules %s to %s",
			hdl_from->name, hdl_to->name);
		return -ENOTSUP;
	}

	sys_slist_append(&handle_from->hdl_dest_list, &handle_to->node);

	return 0;
}

/**
 * @brief Function to disconnect a module.
 *
 */
int amod_disconnect(struct amod_handle *handle, struct amod_handle *handle_disconnect)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	struct _amod_handle *hdl_discon = (struct _amod_handle *)handle_disconnect;
	int index;
	int i;

	if (handle == NULL || handle_disconnect == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (TEST_STATE_RUNNING_OR_OPEN(hdl->state) || hdl->type != AMOD_TYPE_PROCESSOR) {
		LOG_DBG("A module is an invalid state or type for disconnection");
		return -ENOTSUP;
	}

	if (!sys_slist_find_and_remove(&hdl->hdl_dest_list, &remove_hdl->node)) {
		LOG_DBG("Connection to module %s has not been found for module %s",
			remove_hdl->name, hdl->name);
		return -EINVAL;
	}

	return 0;
}

/**
 * @brief Start a module processing data.
 */
int amod_start(struct amod_handle *handle)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (TEST_STATE_RUNNING_OR_OPEN(hdl->state)) {
		LOG_DBG("Module %s in an invalid state, %d, for set configuration", hdl->name,
			hdl->state);
		return -ENOTSUP;
	}

	if (hdl->functions->start != NULL) {
		ret = hdl->functions->start(handle);
		if (ret < 0) {
			LOG_DBG("Failed user start for module %s, ret %d", hdl->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("No user start function for module %s", hdl->name);
	}

	hdl->previous_state = hdl->state;
	hdl->state = AMOD_STATE_RUNNING;

	return 0;
}

/**
 * @brief Pause a module processing data.
 */
int amod_pause(struct amod_handle *handle)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (!TEST_STATE_RUNNING(hdl->state)) {
		LOG_DBG("Module %s in an invalid state, %d, for set configuration", hdl->name,
			hdl->state);
		return -ENOTSUP;
	}

	if (hdl->functions->pause != NULL) {
		ret = hdl->functions->pause(handle);
		if (ret < 0) {
			LOG_DBG("Failed user pause for module %s, ret %d", hdl->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("No user pause function for module %s", hdl->name);
	}

	hdl->previous_state = hdl->state;
	hdl->state = AMOD_STATE_PAUSED;

	return 0;
}

/**
 * @brief Send a data buffer to a module.
 */
int amod_data_send(struct amod_handle *handle, struct aobj_object *object,
		   amod_response_cb response_cb)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (object == NULL) {
		LOG_DBG("Module , %s, data parameter error", hdl->name);
		return -ECONNREFUSED;
	}

	if (!TEST_STATE_RUNNING(hdl->state) || hdl->type == AMOD_TYPE_INPUT) {
		LOG_DBG("Module %s in an invalid state (%d) or type (%d) to send data", hdl->name,
			hdl->state, hdl->type);
		return -ENOTSUP;
	}

	return data_send((void *)NULL, hdl, object, response_cb);
}

/**
 * @brief Retrieve data from the module.
 *
 */
int amod_data_retrieve(struct amod_handle *handle, struct aobj_object *object)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	struct _amod_out_message *out_msg;
	size_t out_msg_size;
	int ret;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (!TEST_STATE_RUNNING(hdl->state) || hdl->type == AMOD_TYPE_OUTPUT) {
		LOG_DBG("Module %s in an invalid state (%d) or type (%d) to receive data",
			hdl->name, hdl->state, hdl->type);
		return -ENOTSUP;
	}

	if (object == NULL) {
		LOG_DBG("Error in output object for module %s", hdl->name);
		return -ECONNREFUSED;
	}

	if (object->data == NULL || object->data_size == 0) {
		LOG_DBG("Error in output data buffer for module %s", hdl->name);
		return -ECONNREFUSED;
	}

	ret = data_fifo_pointer_last_filled_get(&hdl->out_msg, (void **)&out_msg, &out_msg_size,
						K_FOREVER);
	if (ret) {
		LOG_DBG("Failed to retrieve data from module %s, ret %d", hdl->name, ret);
		return ret;
	}

	if (out_msg->object.data == NULL || out_msg->object.data_size == 0) {
		LOG_DBG("Data output buffer too small for received buffer from module %s",
			hdl->name);
		return -EINVAL;
	}

	memcpy(object, &out_msg->object, sizeof(struct aobj_object));

	data_fifo_block_free(&hdl->out_msg, (void **)&out_msg);

